wan0net/thistle-os/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash (16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Compiler optimization for size (critical — we have 10+ apps)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM — ESP32-S3R8 has 8MB OPI PSRAM, but accessed in QUAD mode (same as v5.5 config)
# OCT mode failed to init in IDF v6; QUAD mode works and is what v5.5 used.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY renamed to FREERTOS_TASK_CREATE_ALLOW_EXT_MEM in IDF v6
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SD Card (SDMMC)
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Keep newly installed OTA images rollback-eligible until app_main confirms
# the post-initialization health milestone.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# LVGL fonts (enable sizes used by ThistleOS UI)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y

# Bluetooth (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# PPP for cellular data (required by drv_modem_a7682e esp_modem backend)
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y

# Uncomment to run ThistleOS unit tests on boot instead of normal boot sequence
# CONFIG_THISTLE_RUN_TESTS=y
